Repository: joshanashakya/literature_review
Catalog: workspace/opus_corpus/compiled/ted2020v1/en-ne.tmx
Source language: en
Languages: ne

source: It involved some really cool auxiliary percussion instruments, like the bongos, timpani, and timbales, and cowbell.
ne: यसका सहायक बाजाहरु मज्जाका थिए, जस्तै : बोंगो, तिम्पनी, तिम्बालेस र घन्टी

source: So it was fun, but it involved no marching, and I was just so devastated.
ne: यो रमाइलो त थियो, तर मलाई समूहमा हिड्ने मन थियो, म निराश भएँ ।

source: However, nothing was going to stop me from playing snare drum with the marching band in the halftime show.
ne: मध्यान्नमा ड्रम झुन्डाएर मार्च पास गर्ने मेरो रहरलाई रोक्नसक्ने तागत कसैको थिएन ।

source: So my family and I worked with an engineer to design a snare drum harness that would be lighter, and easier for me to carry.
ne: एकजना इन्जिनियरसंग मिलेर हाम्रो परिवारले एउटा ड्रमको डिजाइन बनायौं, जून हलुगो र घाँटीमा झुन्ड्याएर हिड्न मिल्ने थियो ।

source: So after continuous work, we made a snare drum apparatus that weighs only about 6 pounds.
ne: लामो समयको मेहेनेत पछि, लगभग ३ किलो तौल भएको ड्रम बनाउन हामी सफल भयौं ।

source: (Applause) I just want to give you some more information about Progeria.
ne: (ताली) प्रोजेरियाको बारेमा अलिकति अरु -

source: It affects only about 350 kids today, worldwide.
ne: बिश्वभरि नै गरेर जम्मा ३५० जना केटाकेटीलाइ यो रोग लागेको छ

source: So it's pretty rare, and the effects of Progeria include: tight skin, lack of weight gain, stunted growth, and heart disease.
ne: यो असाधारण रोग हो, प्रोजेरियाले असर गर्ने अन्य कुराहरुमा - छाला कस्सिने, तौल नबढ्ने, शरीरको बृध्दि नहुने, मुटुको रोग लाग्ने आदि हुनसक्छ ।

source: Last year my Mom and her team of scientists published the first successful Progeria Treatment Study, and because of this I was interviewed on NPR, and John Hamilton asked me the question: "What is the most important thing that people should know about you?"
ne: गएको बर्ष मेरो आमा र उहाँको बैज्ञानिक समूह मिलेर प्रोजेरिया उपचार अध्ययन प्रकाशित गर्यो यसैको कारणले NPR वालाले मेरो अन्तरबार्ता लिएका थिए जोन ह्यामिल्टनले मलाई सोधेका थिए - तिम्रो बारेमा मानिसले थाहा पाउनु पर्ने महत्वपुर्ण कुरा के हो ?

source: And my answer was simply that I have a very happy life.
ne: मेरो सिधा उत्तर थियो - मेरो जीवन खुशीले भरिपूर्ण छ

source: (Applause) So even though there are many obstacles in my life, with a lot of them being created by Progeria, I don't want people to feel bad for me.
ne: (ताली) मेरो जीवनमा निकै अवरोधहरु छन र ती मध्ये अधिकांस त प्रोजेरियाले सिर्जना गरेका हुन् । तर म चाहन्न मानिसहरु मलाई देखेर दु:खी बनुन

source: I don't think about these obstacles all the time, and I'm able to overcome most of them anyway.
ne: म जतिखेर पनि आफ्नो समस्याको बारेमा सोच्दिन किन कि, म यी समस्याबाट पार पाउने नै छु ।

source: So I’m here today, to share with you my philosophy for a happy life.
ne: तेसैले, आज यहाँ छु मेरो सुखी जीवनदर्शन सुनाउन

source: So, for me, there are 3 aspects to this philosophy.
ne: मेरो जीवनदर्शनका ३ धारणाहरु छन -

source: So this is a quote from the famous Ferris Bueller.
ne: फेरिस बुलरको कोटेशन जस्तै

source: The first aspect to my philosophy is that I’m okay with what I ultimately can’t do because there is so much I can do.
ne: मेरो जीवनदर्शनको पहिलो धारणा हो - अत्ति कठिन काम गर्ने नसकेकोमा म दुखि हुन्न किनकि मैले गर्नसक्ने काम धेरै नै छन ।

source: Now people sometimes ask me questions like, "Isn’t it hard living with Progeria?" or "What daily challenges of Progeria do you face?"
ne: कहिलेकहीं मानिसहरु मलाई सोध्ने गर्छन - प्रोजेरिया भएको जीवन बाँच्न कठिन छैन ? वा दैनिक जीवन कत्तिको कस्टकर बनाएकोछ

source: And I’d like to say that, even though I have Progeria, most of my time is spent thinking about things that have nothing to do with Progeria at all.
ne: म भन्न चाहन्छु - मलाई प्रोजेरिया भएपनि, प्राय: म यस्ता बिषयहरु सोच्नमा व्यस्त हुन्छु जसलाई प्रोजेरियासंग केहि लिनु दिनु छैन ।

source: Now this doesn’t mean that I ignore the negative aspects of these obstacles.
ne: यसको अर्थ यो होइन कि यसको नकारात्मक पक्षलाइ बेवास्ता गर्छु ।

source: When I can’t do something like run a long distance, or go on an intense roller coaster, I know what I’m missing out on.
ne: लामो समय दौडिने, वा रोलर कोस्टर चड़ने जस्ता कामहरु गर्न नसक्दा पक्कै पनि

source: But instead, I choose to focus on the activities that I can do through things that I’m passionate about, like scouting, or music, or comic books, or any of my favorite Boston sports teams.
ne: मलाई नरमाइलो लाग्छ । तर म गर्न नसकेको काममा दुखि हुनुभन्दा मलाई मनपर्ने र गर्न पनि सक्ने क्रियाकलापमा बढी ध्यान दिन्छु । जस्तै: स्काउट, संगीत, कमिक पढ्नु, वा मलाई सबै भन्दा मनपर्ने टिमको खेल हेर्नु ।

source: Yeah, so -- (Laughter) However, sometimes I need to find a different way to do something by making adjustments, and I want to put those things in the "can do" category.
ne: (हाँसो) कहिले काहीं कुनै काम गर्न फरक तरिकाले सोच्नुपर्छ, नया उपाय लगाउनु पर्छ, थोरै सम्झौता गरेर भएपनि गर्न सक्छुमा बदल्नु पर्छ ।

source: Kind of like you saw with the drum earlier.
ne: जस्तो कि अघि देखि हाल्नुभो घाँटीमा झुन्ड्याउने ड्रम।

source: So here’s a clip with me playing Spider-Man with the Foxboro High School Marching Band at halftime a couple of years ago.
ne: केहि बर्ष अगाडीको एउटा क्लिप्स देखाउँदै छु – यसमा फक्सबोरो स्कूलको मध्यान्हको मार्च पासमा म स्पाइडर म्यानको धुन बजाउदै छु ।

source: (Video) ♫ Spider-Man theme song ♫ (Applause) Thank you.
ne: (भिडियो) (स्पाइडर म्यानको मुख्य गीत ) (ताली) धन्यबाद !

source: All right, all right, so -- That was pretty cool, and so I was able to accomplish my dream of playing snare drum with the marching band, as I believe I can do for all of my dreams.
ne: ! कस्तो लाग्यो ? रमाइलो भएको थियो यसरी मैले, ड्रम बजाएर मार्च पास गर्ने मेरो सपना पुरा गरेरै छाडें । म आफ्नो सपना पुरा गर्न जति संघर्ष पनि गर्न सक्छु ।

source: So hopefully, you can accomplish your dreams as well, with this outlook.
ne: मलाई लाग्छ, दृढ विश्वासले तपाईपनि आफ्नो सपना साकार पार्न सक्नुहुन्छ ।

source: The next aspect to my philosophy is that I surround myself with people I want to be with, people of high quality.
ne: मेरो जीवनदर्शनको अर्को धारणा छ - म, राम्रा विचार भएका र मलाई मनपर्ने मानिसहरु संग मात्रै संगत गर्छु ।

source: I’m extremely lucky to have an amazing family, who have always supported me throughout my entire life.
ne: म आफुलाई सार्है भाग्यमानी सम्झिन्छु आदर्श परिवार पाएर जसले जीवनभरी नै मलाई साथ दिएको छ ।

source: And I’m also really fortunate to have a really close group of friends at school.
ne: स्कुलमा मिल्ने साथीहरु पाउनु पनि मेरो सौभाग्य हो ।

source: Now we’re kind of goofy, a lot of us are band geeks, but we really enjoy each other’s company, and we help each other out when we need to.
ne: अचेल ब्याण्डप्रति अलि बढी नै ध्यान दिएर हामी बदमाश भएका छौं । तर जे होस्, हामीलाइ एक अर्का संग खेल्न खुब मन पर्छ साथै हामी एक अर्कालाई मद्धत गर्न सदा तत्पर छौं

source: We see each other for who we are on the inside.
ne: हामी भित्रबाट जस्तो छौं, अरुलाई पनि तेस्तै देख्छौं

source: So this is us goofing off a little bit.
ne: यो अलि बदमाशी हो कि !

source: So we’re juniors in High School now, and we can now mentor younger band members, as a single collective unit.
ne: अहिले हामी माध्यमिक बिद्यालयमा छौं र आफूभन्दा सानो तहका सदस्यहरुलाइ संयुक्तरुपमा प्रशिक्षण गर्न पाउछौँ ।

source: What I love about being in a group like the band, is that the music that we make together, is true, is genuine, and it supersedes Progeria.
ne: मलाई ब्याण्ड जस्तो समूहमा के मनपर्छ भने, हामीले संगैबसेर बनाएको संगीत सच्चा र आधिकारिक हुन्छ र

source: So I don’t have to worry about that when I’m feeling so good about making music.
ne: जब म संगीत भर्नमा मस्त हुन्छु, प्रोजेरियाको बारेमा सोच्न पनि भ्याउन्न

source: But even having made a documentary, going on TV a couple of times, I feel like I’m at my highest point when I’m with the people that surround me every day.
ne: मेरो बारेमा डकुमेन्ट्री बनिसक्यो, कतिपटक TV मा आइसकें, तैपनि मलाई हरेक दिन, आफ्नै साथीहरुसंग घुलमिल गर्दानै सबै भन्दा रमाइलो लाग्छ ।

source: They provide the real positive influences in my life, as I hope I can provide a positive influence in theirs as well.
ne: उनीहरुको साथले मलाइ सकारात्मक उर्जा दिन्छ मलाई लाग्छ म पनि उनीहरुलाई सकारात्मक उर्जा दिन्छु

source: (Applause) Thank you.
ne: (तालि) धन्यवाद !

source: So the bottom line here, is that I hope you appreciate and love your family, love your friends, for you guys, love you Bro’s and acknowledge your mentors, and your community, because they are a very real aspect of everyday life, they can make a truly significant, positive impact.
ne: ! निस्कर्षमा भन्दा - आफ्नो परिवारलाई माया र सम्मान गर्नुहोस, साथीहरुलाई माया दिनुहोस, आफ्नो प्रशिक्षक र समूदाय प्रति कृतज्ञ हुनुहोस । किनकि दैनिक जीवनका प्रमुख आधार उनीहरु नै हुन् तिनैले जीवनमा सकारात्मक प्रभाब पार्छन

source: The third aspect to the philosophy is, Keep moving forward.
ne: मेरो जीवनदर्शनको तेस्रो आधार हो - अगाडी बढ्दै रहनु ।

source: Here’s a quote by a man you may know, named Walt Disney, and it’s one of my favorite quotes.
ne: मलाई मनपर्ने कोटेशन मध्येको एक वाल्ट डिज्नीको कोटेशन सम्झिन चाहन्छु -

source: I always try to have something to look forward to.
ne: म सधैंअगाडी बढीरहन केहि खोजि रहन्छु

source: Something to strive for to make my life richer.
ne: जीवन सम्पन्न बनाउने उपाय खोजिरहन्छु

source: It doesn’t have to be big.
ne: ठुलो कुरा हुनपनि पर्दैन

source: It could be anything from looking forward to the next comic book to come out, or going on a large family vacation, or hanging out with my friends, to going to the next High School football game.
ne: कुनै पनि साधारण कुरा हुनसक्छ जस्तै: नया कमिक आउने प्रतिक्षा वा सबै परिवार छुट्टीमा घुम्न जाने वा साथीभाईहरुसंग गफ गाफ वा अर्को हाई स्कुल फुटबल म्याच

source: However, all of these things keep me focused, and know that there’s a bright future ahead, and may get me through some difficult times that I may be having.
ne: यी कुनै पनि कुराले मेरो ध्यान केन्द्रित गरिराख्छ र मलाई भनिराख्छ - अगाडी सुन्दर भबिष्य छ बाटोमा समस्याहरु आएपनि मलाई अगाडी बढाउनेछ

source: Now this mentality includes staying in a forward thinking state of mind.
ne: यहि मनस्थिति नै भबिश्य द्रस्टा हो

source: I try hard not to waste energy feeling badly for myself, because when I do, I get stuck in a paradox, where there’s no room for any happiness or any other emotion.
ne: आफ्नै कमजोरीको बारेमा सोच्न म उर्जा खर्चिन्न यसले मानसिक विरोधाभासमा फसाउँछ जहाँ अरु कुनै खुशी वा भावनाको स्थान रहन्न ।

source: Now, it’s not that I ignore when I’m feeling badly, I kind of accept it, I let it in, so that I can acknowledge it, and do what I need to do to move past it.
ne: तर यो होइन, म दुखि भएर सबै कुराहरुको बेवास्ता गरूँ एक किसिमले म स्विकार्छु यी भावनालाई आउन दिन्छु ताकी अवस्थालाइ बुझ्न सकूँ अनि जे आवस्यक छ, त्यो गरेर अगाडी बढ्छु

source: When I was younger, I wanted to be an engineer.
ne: म सानो हुँदा इन्जिनियर बन्न चाहन्थें

source: I wanted to be an inventor, who would catapult the world into a better future.
ne: म आविस्कारक बन्न चाहन्थें जसले विश्वलाई आकर्षक भबिष्यमा रूपान्तरत गर्न सकोस

source: Maybe this came from my love of Legos, and the freedom of expression that I felt when I was building with them.
ne: सायद यस्तो विचार लेगो खेलबाट आयो होला मैंले अभिव्यक्ति स्वतन्त्रताको अनुभव लेगो खेल्दा गरेँ ।

source: And this was also derived from my family and my mentors, who always make me feel whole, and good about myself.
ne: यसको श्रेय पनि परिवार र प्रशिक्षकलाइ नै जान्छ । वहाँहरु सधै मलाई - पूर्ण र सक्षम छु भन्ने भावना जगाउनुहुन्छ ।

source: Now today my ambitions have changed a little bit, I’d like to go into the field of Biology, maybe cell biology, or genetics, or biochemistry, or really anything.
ne: आजभोली मेरो चाहनामा थोरै परिवर्तन आएको छ म अब बायोलोजी पढ्ने बिचारमा छु, हुनसक्छ सेल बायोलोजी, जेनिटिक्स वा बायोकेमेस्ट्री तर केहि न केहि चैं पक्कै !

source: This is a friend of mine, who I look up to, Francis Collins, the director of the NIH, and this is us at TEDMED last year, chatting away.
ne: ! मेरो मनपर्ने साथीहरु मध्येको हुन् यी - NIH का निर्देशक - फ्रान्सिस कोलिन्स । गत बर्षको TEDMED को कुराकानीको बेलाको हो यो

source: I feel that no matter what I choose to become, I believe that I can change the world.
ne: मलाई बिश्वास छ, म जो बन्न रोजे पनि संसारलाइ परिवर्तनगर्ने क्षमता मसंग छ

source: And as I’m striving to change the world, I will be happy.
ne: संसार परिवर्तन गर्ने अठोटले म खुशी छु ।

source: About four years ago, HBO began to film a documentary about my family and me called “Life According to Sam”.
ne: ४ बर्ष अगाडिको कुरा हो, HBO ले म र मेरो परिवारको बारेमा एउटा डकुमेन्ट्री बनाउँदै थियो - जीवन-सामको बिचारमा ।

source: That was a pretty great experience, but it was also four years ago.
ne: ४ बर्ष अगाडिको त्यो एउटा रमाइलोअनुभव थियो।

source: And like anyone, my views on many things have changed, and hopefully matured, like my potential career choice.
ne: अरु जस्तै, मेरो हेराइमा धेरै परिवर्तन आइसकेकोछ सम्भवत: भबिष्यको बारेमा सोच्न सक्ने भइसकें ।

source: However, some things have stayed the same throughout that time.
ne: तर जीवनका केहि कुराहरुमा कहिल्यै परिवर्तन आएनन ।

source: Like my mentality, and philosophy towards life.
ne: जस्तै : मेरो मनस्थिति र जीवनलाई हेर्ने दृस्टीकोण ।

source: So I would like to show you a clip of my younger self from the film, that I feel embodies that philosophy.
ne: म तपाईंलाइ त्यहि फिल्मको एउटा सानो दृश्य देखाउन चाहन्छु, जसले मेरो जीवन दर्शन झल्काउँछ

source: (Video) I know more about it genetically.
ne: (भिडियो) वंशाणुगतरुपमै यो कुरा म बढी नै जान्दछु,

source: So it’s less of an embodiment now.
ne: र यो कुरा मलाई खासै ठुलो पनि लाग्दैन

source: It used to be like this thing that prevents me from doing all this stuff, that causes other kids to die, that causes everybody to be stressed, and now it’s a protein that is abnormal, that weakens the structure of cells.
ne: यो के कारण हो, जसले म अरु जस्तै साधारण काम गर्न सक्दिन, कतिपय बच्चाको मृत्युको कारण बन्दछ, र सबैलाई तनाबमा राख्दछ त्यो हो - प्रोटिनको असमान्यता । यसले शरीरका कोषीकाहरुलाइ कमजोर बनाउछ ।

source: So, and it takes a burden off of me because now I don’t have to think about Progeria as an entity.
ne: यो कुरा बुझेपछि मेरो मन हलुङ्गो भयो, किन कि, अब मैंले प्रोजेरियाको बारेमा सोचिराख्नु परेन ।

source: Okay, pretty good, huh?
ne: हो कि होइन त ?

source: So, as you can see I’ve been thinking this way for many years.
ne: ! लामो समयदेखि म यसैगरि सोच्दै आइरहेको छु ।

source: But I’d never really had to apply all of these aspects of my philosophy to the test at one time, until last January.
ne: मैले मेरो जीवनका साह्रा जीवन दर्शनलाई एकसाथ परिक्षण गर्नु परेको थिएन, तर गत जनवरीमा त्यो पर्यो ।

source: I was pretty sick, I had a chest cold, and I was in the hospital for a few days, and I was secluded from all of the aspects of my life that I felt made me, me, that kind of gave me my identity.
ne: छातीको चिसोले बिरामी भएर केहि दिन अस्पताल बसें मलाई त्यतिखेर "म" भनेर चिनाउने, मेरो परिचय गराउने सबै कुराहरुबाट एक्लिन परेको अनुभव भएको थियो ।

source: But knowing that I was going to get better, and looking forward to a time that I would feel good again, helped me to keep moving forward.
ne: फेरी स्वस्थ हुन्छु भन्ने बिचारले आफू ठिक भएको समयको कल्पनाले मलाई हौसला राख्ने प्रेरणा दिइरहेको थियो ।

source: And sometimes I had to be brave, and it wasn’t always easy.
ne: कहिले काहीं, म साहसी बन्नु पर्थ्यो र यो काम त्यति सजिलो थिएन ।

source: Sometimes I faltered, I had bad days, but I realized that being brave isn’t supposed to be easy.
ne: कहिलेकाहीं लर्बराउथें नराम्रा दिनहरु आउंथे । अनि सोच्थें, त्यसै साहसी बनिन्छ त

source: And for me, I feel it’s the key way to keep moving forward.
ne: मलाई अगाडी बढाईरहने मुख्य तरिका नै यहि हो

source: So, all in all, I don’t waste energy feeling bad for myself.
ne: समग्रमा भन्दा - आफुलाई दुखि बनाउन म समय खर्चिन्न

source: I surround myself with people that I want to be with, and I keep moving forward.
ne: आफूले चाहेको मानिससंग उठबस गर्छु र अगाडी बढीरहन्छु ।

source: So with this philosophy, I hope that all of you, regardless of your obstacles, can have a very happy life as well.
ne: मलाई लाग्छ, यस्तै दर्शनले तपाईपनि आएका सबै बाधा पन्छाउँदै जीवन सुखमय बनाउन सक्नुहुन्छ ।

source: Oh, wait, hang on a second, one more piece of advice –- (Laughter) Never miss a party if you can help it.
ne: एउटा कुरा झन्डै बिर्सेको, अर्को एउटा सानो सल्लाह (हाँसो) पार्टी (जमघट) मा जान चै, नछाड्नुहोला ।

source: My school’s homecoming dance is tomorrow night, and I will be there.
ne: मेरो स्कूलमा भोलि एउटा डान्स पार्टी छ, म पक्कै त्यहीं हुनेछु ।

source: Thank you very much.
ne: धेरै धेरै धन्यवाद !

source: I want to discuss with you this afternoon why you're going to fail to have a great career.
ne: यस मध्यान्ह म तपाईंहरु संग छलफल गर्दैछु - किन तपाईं सर्बोत्कृस्ट पेशा पाउन असक्षम हुनुहुनेछ

source: (Laughter) I'm an economist.
ne: -----(हाँसो)----- म अर्थशास्त्री हुँ ।

source: I do dismal.
ne: म उदास रहने गर्छु ।

source: End of the day, it's ready for dismal remarks.
ne: दिनको समाप्तिसंगै उदास प्रतिक्रियाको बेला हुन्छ ।

source: I only want to talk to those of you who want a great career.
ne: म तपाईंहरु मध्य सर्बोत्कृस्ट पेशा चाहनेहरुसंग मात्रै कुरा गर्छु ।

source: I know some of you have already decided you want a good career.
ne: तपाई मध्ये कतिपयले राम्रो पेशा बनाउने निर्णय गर्नुभएको छ ।

source: You're going to fail, too.
ne: तपाईंपनि असफल नै हुनुहुने छ ।

source: (Laughter) Because -- goodness, you're all cheery about failing.
ne: -----(हाँसो)----- किनभने-- हे प्रभु, असफल हुन खोज्दा पनि प्रशन्न !

source: (Laughter) Canadian group, undoubtedly.
ne: -----(हाँसो)----- पक्कैपनि, क्यानेडियन समूह !

source: (Laughter) Those trying to have good careers are going to fail, because, really, good jobs are now disappearing.
ne: -----(हाँसो)----- राम्रो पेशा चाहने जो हुनुहुन्छ, असफल हुदै हुनुहुन्छ किनकि, बास्तवमै, अचेल राम्रो पेशा हराउदै छन् ।

source: There are great jobs and great careers, and then there are the high-workload, high-stress, bloodsucking, soul-destroying kinds of jobs, and practically nothing in-between.
ne: सर्बोत्कृस्ट काम र पेशा भेटिन्छन्, र ती संगै कामको चाप, उच्च तनाव, आत्मा मारेर रगत पसिना एक गर्नु पर्ने अवस्था आउँछ, ब्यावहारिक रुपमा बिचमा केहि हुन्न

source: So people looking for good jobs are going to fail.
ne: तेसैले राम्रो काम खोज्नेहरु अन्तत: असफल हुन्छन् ।

source: I want to talk about those looking for great jobs, great careers, and why you're going to fail.
ne: म सर्बोत्कृस्ट काम, पेशा खोज्नेहरुको कुरा गर्दै छु, तपाईंहरु किन असफल हुँदै हुनुहुन्छ ।

source: First reason is that no matter how many times people tell you, "If you want a great career, you have to pursue your passion, you have to pursue your dreams, you have to pursue the greatest fascination in your life," you hear it again and again, and then you decide not to do it.
ne: पहिलो कारण, मानिसहरुले जतिपटक नै किन नभनुन्, "तिमी सर्बोत्कृस्ट पेशा चाहान्छौ भने, आफ्नो अभिलाषा पछ्याउ, आफ्नो सपनाको पछि लाग, र पछि लाग, आफ्नो सबै भन्दा ठुलो कल्पनाको", तपाईं बारम्बार यहि कुरा सुनेपनि आफ्नो विचार परित्याग गर्नुहुनेछ

source: It doesn't matter how many times you download Steven J.'s Stanford commencement address, you still look at it and decide not to do it.
ne: यसले केहि फरक पर्दैन कि तपाईंले कति पटक Steven J को स्ट्यान्डफोर्ड शुभारम्भ संबोधन download गर्नुभो, जतिपटक त्यो संबोधन हेरेपनि हताश नै हुनुभो

source: I'm not quite sure why you decide not to do it.
ne: मलाई थाहा छैन तपाई किन यस्तो हताश हुनुभो ।

source: You're too lazy to do it. It's too hard.
ne: तपाईं अल्छि हुनुहुन्छ वा यो काम नै कठिन छ

source: You're afraid if you look for your passion and don't find it, you'll feel like you're an idiot, so then you make excuses about why you're not going to look for your passion.
ne: तपाईं डराउनुहुन्छ, जब यो काममा आफ्नो अभिलाषा देख्नुहुन्न, आफू मुर्ख भएजस्तो महसुश गरेर, बिभिन्न बहाना बनाउनुहुन्छ कसरी यो कामबाट हात झिकौं भनेर

source: They are excuses, ladies and gentlemen.
ne: महिला तथा सज्जनबृन्द त्यो केवल बहाना हो

source: We're going to go through a whole long list -- your creativity in thinking of excuses not to do what you really need to do if you want to have a great career.
ne: हामी एउटा तालिका बनाउन सक्छौं -- गर्नै पर्ने कामहरु नगर्न सिर्जना गरिएका बहानाहरुको जून कामहरु, सर्बोत्कृस्ट पेशा प्राप्त गर्न अत्यावाशक थिए

source: So, for example, one of your great excuses is: (Sigh) "Well, great careers are really and truly, for most people, just a matter of luck.
ne: उदाहरणको लागि तपाईंहरुको एउटा बहाना - ---(लामो स्वाश)--- "बास्तवमा,सर्बोत्कृस्ट पेशा भनेको प्राय: भाग्यमा भर पर्ने कुरा हो"

source: So I'm going to stand around, I'm going to try to be lucky, and if I'm lucky, I'll have a great career.
ne: त्यसैले म पनि प्रयाश गर्दै गर्छु, भाग्यले कतिको साथ् दिन्छ, भाग्यमा रहेछ भने सर्बोत्कृस्ट पेशा भेट्नेछु

source: If not, I'll have a good career."
ne: रैन्छ भने, राम्रो कार्य भेटिएला"

source: But a good career is an impossibility, so that's not going to work.
ne: राम्रो कार्य लगभग असम्भव जस्तै हो, केहि हुनेवाला छैन ।

source: Then, your other excuse is, "Yes, there are special people who pursue their passions, but they are geniuses.
ne: तपाईंको अर्को बहाना हुनेछ : आफ्नो अभिलाषाको पछिलाग्ने मानिस, बेग्लै हुन्छन, असाधारण हुन्छन् ।

source: They are Steven J.
ne: उनीहरु Steven J.

source: I'm not a genius.
ne: हुन् म त्यस्तो असाधारण छैन ।

source: When I was five, I thought I was a genius, but my professors have beaten that idea out of my head long since."
ne: ५ बर्षको छँदा, म पनि असाधारण छु जस्तो लाग्थ्यो । मेरो प्रोफेसरहरुले धेरै अगाडी त्यो विचार सफा गर्दिसके" ।

source: (Laughter) "And now I know I am completely competent."
ne: -----(हाँसो)----- मलाई थाहा छ, म सामान्य छु ।

source: Now, you see, if this was 1950, being completely competent -- that would have given you a great career.
ne: यदि यो सामान्य हुने कुरा, १९५० तिर भए -- तपाईंलाइ महान व्यक्ति बनाउथ्यो ।

source: But guess what?
ne: तर के त ?

source: This is almost 2012, and saying to the world, "I am totally, completely competent," is damning yourself with the faintest of praise.
ne: लगभग २०१२ को समयमा, यो संसारलाइ "म केवल साधारण क्षमताको हुँ" भन्नु भनेको आफैंले आफ्नो घातक प्रसंसा गर्नु जस्तै हो

source: And then, of course, another excuse: "Well, I would do this, I would do this, but, but -- well, after all, I'm not weird.
ne: त्यसपछि निश्चितरुपमा अर्को बहाना : हुन त म यो काम गर्न सक्थें, तर .. तर .... म त्यस्तो बिचित्रको मान्छे होइन ।

source: Everybody knows that people who pursue their passions are somewhat obsessive.
ne: सबैलाई थाहा छ, आफ्नो अभिलाषाको पछि लाग्ने मानिस अलिकति अप्ठ्यारा हुन्छन् ।

source: A little strange.
ne: अनौठा खालका ।

source: Hmm? Hmm? Okay?
ne: हो कि होइन ?

source: You know, a fine line between madness and genius.
ne: एउटा बिभाजन रेखा - पागलपन र असाधारण क्षमता बीचको ।

source: "I'm not weird. I've read Steven J.'s biography.
ne: म अप्ठ्यारो होइन, मैले Steven J. को जीवनकथा पढेको छु ।

source: Oh my goodness -- I'm not that person. I am nice.
ne: हे भगवान ... म त्यस्तो मान्छे होइन क्या!!

source: I am normal.
ne: म ज्ञानी छु । म बिल्कुल ठिक छु ।

source: I'm a nice, normal person, and nice, normal people -- don't have passion."
ne: म ज्ञानी, बिल्कुल ठिक ज्ञानी र बिल्कुल ठिक ---- किनकि म संग कुनै अभिलाषा छैन ।

source: (Laughter) "Ah, but I still want a great career.
ne: -----(हाँसो)----- "तैपनि, म महान व्यक्ति बन्न चाहन्छु ।

source: I'm not prepared to pursue my passion, so I know what I'm going to do, because I have a solution.
ne: म आफ्नो अभिलाषा प्रति समर्पित छैन , त्यसैले मलाई थाहा छ, के गर्ने किनकि म संग उपाय छ ।

source: I have a strategy.
ne: म संग योजना छ ।

source: It's the one Mommy and Daddy told me about.
ne: यो मलाई मेरो बा आमाले सिकाएको कुरा हो ।

source: Mommy and Daddy told me that if I worked hard, I'd have a good career.
ne: बा आमाले भनेको, यदि मैंले कडा परिश्रम गरें भने - मैंले सर्बोत्कृस्ट पेशा पाउने छु ।

source: So, if you work hard and have a good career, if you work really, really, really hard, you'll have a great career.
ne: तसर्थ, कडा मेहनेत गर, राम्रो कार्य गर । यदि तिमीले धेरै धेरै मेहेनत गर्यौ भने सर्बोत्कृस्ट पेशा पाउनेछौ
